; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite1 Star11)
	(pointing satellite2 Planet16)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 spectrograph2)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 spectrograph0)
	(have_image Planet9 spectrograph2)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 spectrograph2)
	(have_image Star13 spectrograph0)
	(have_image Planet14 spectrograph2)
	(have_image Planet15 spectrograph0)
	(have_image Planet16 thermograph1)
	(have_image Planet17 spectrograph2)
))

)

; plan
1. (turn_to satellite2 planet16 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet16)
   goals met: 1 of 16
2. (turn_to satellite1 groundstation3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation3)
   goals met: 1 of 16
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 16
4. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 16
5. (turn_to satellite1 planet15 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet15)
   goals met: 1 of 16
6. (take_image satellite1 planet15 instrument2 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 2 of 16
7. (turn_to satellite1 phenomenon5 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 16
8. (take_image satellite1 phenomenon5 instrument2 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 3 of 16
9. (turn_to satellite1 phenomenon10 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 16
10. (take_image satellite1 phenomenon10 instrument2 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 4 of 16
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 16
12. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 4 of 16
13. (turn_to satellite0 phenomenon12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 16
14. (take_image satellite0 phenomenon12 instrument0 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 5 of 16
15. (turn_to satellite0 planet14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet14)
   goals met: 5 of 16
16. (take_image satellite0 planet14 instrument0 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 6 of 16
17. (turn_to satellite0 planet17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet17)
   goals met: 6 of 16
18. (take_image satellite0 planet17 instrument0 spectrograph2)
   added: (have_image planet17 spectrograph2)
   goals met: 7 of 16
19. (turn_to satellite0 planet6 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet6)
   goals met: 7 of 16
20. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 8 of 16
21. (turn_to satellite0 planet9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet9)
   goals met: 8 of 16
22. (take_image satellite0 planet9 instrument0 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 9 of 16
23. (turn_to satellite0 phenomenon7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon7)
   goals met: 10 of 16
24. (take_image satellite0 phenomenon7 instrument0 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 11 of 16
25. (turn_to satellite1 planet16 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet16)
   goals met: 11 of 16
26. (take_image satellite1 planet16 instrument2 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 12 of 16
27. (turn_to satellite1 star13 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star13)
   goals met: 12 of 16
28. (take_image satellite1 star13 instrument2 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 13 of 16
29. (turn_to satellite1 star8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star8)
   goals met: 13 of 16
30. (take_image satellite1 star8 instrument2 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 14 of 16
31. (turn_to satellite1 star11 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star11)
   goals met: 15 of 16
32. (take_image satellite1 star11 instrument2 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 16 of 16
